app/views/bookmarks/index.html.erb

SELECT "outputs".* FROM "outputs" WHERE "outputs"."id" IN (?, ?)  [["id", 2], ["id", 3]]
---
        <div class="d-flex justify-content-between align-items-start mb-2">
          <h5 class="card-title"><%= bookmark.output.city %>,<%= bookmark.output.country %></h5>