app/controllers/bookmarks_controller.rb

  def index
    @bookmarks = current_user.bookmarks.includes(:output)
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ?  [["user_id", 1]]
SELECT "outputs".* FROM "outputs" WHERE "outputs"."id" IN (?, ?)  [["id", 2], ["id", 3]]

  def create
    @bookmark = current_user.bookmarks.create(output_id: params[:output_id])
---
INSERT INTO "bookmarks" ("user_id", "output_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["output_id", 2], ["created_at", "2025-10-31 21:29:37.938637"], ["updated_at", "2025-10-31 21:29:37.938637"]]

  def destroy
    current_user.bookmarks.find(params[:id]).destroy
---
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ? AND "bookmarks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]