app/controllers/home_controller.rb

  def select
    # Make the country and city variables
    country = params[:country]
    city = params[:city]

    # Create output variable and use OpenAI service
    output = OpenaiService.generate_fact(city, country)

    # Output instance which is the easiest way I know to store and send a hash of data
    @output = Output.create(city: city, country: country, text: output)
---
INSERT INTO "outputs" ("city", "country", "text", "source", "created_at", "updated_at", "latitude", "longitude") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"